app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
---
  def index
    @songs = @artist && @artist.songs || Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---
  def find_artist
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def find_song
    if params[:id]
      if @artist
        @song = @artist.songs.find_by(id: params[:id])